<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | Следующие языковые строки используются при аутентификации для различных
    | сообщения, которые нам нужно отобразить пользователю. Вы можете изменить
    | эти языковые строки в соответствии с требованиями вашего приложения.
    |
    */

    'failed' => 'Учетная запись не существует.',
    'password' => 'Предоставленный пароль неверен.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, повторите попытку через :секунд секунды.',

];
