<template>
  <div class="container scheme">
    <div data-aos="flip-up" v-for="(step, i) in scheme.slice(0, scheme.length / 2)" class="flex aic scheme__step card">
      <div class="card-body">
        <div class="flex jcc mb-3 count">{{ i + 1 }}</div>
        {{ step }}
      </div>
    </div>

    <div data-aos="flip-up" v-for="(step, i) in scheme.slice(scheme.length / 2, scheme.length)"
      class="flex aic scheme__step card">
      <div class="card-body">
        <div class="flex jcc mb-3 count">{{ i + scheme.length / 2 + 1 }}</div>

        {{ step }}
      </div>
    </div>

  </div>
</template>

<script>
export default {
  data: () => ({
    scheme: [
      'На первом этапе мы проводим консультацию с клиентом, чтобы уточнить все требования и задачи. Мы обсуждаем детали проекта, необходимые материалы и технические параметры, чтобы предложить наиболее подходящее решение.',
      'На основе собранных требований мы разрабатываем техническое задание и создаем проектную документацию. Это включает создание чертежей и технических схем, которые будут использоваться в процессе производства.',
      'После утверждения проекта мы закупаем необходимые материалы и планируем производственные процессы. Это включает разработку графика работ и подбор подходящего оборудования для выполнения задачи.',
      'На этом этапе происходит непосредственное производство и обработка деталей. Мы выполняем все необходимые операции, такие как токарные, фрезерные, зубонарезные работы, шлифовка, закалка и другие, чтобы получить готовое изделие.',
      'После завершения производства все изделия проходят тщательный контроль качества. Мы проверяем точность выполнения работ, соответствие чертежам и стандартам. При необходимости проводятся испытания на прочность и функциональность.',
      'Готовые изделия доставляются клиенту и устанавливаются на производственной площадке. Мы проводим необходимые пусконаладочные работы и вводим оборудование в эксплуатацию, чтобы убедиться в его корректной работе.'
    ]
  })
}

</script>

<style>
.scheme {
  display: grid;
  grid-template-columns: repeat(auto-fill, minmax(400px, 1fr));
  gap: 10px;

  .count {
    font-size: 24px;
  }

  &__step {

    i {
      font-size: 24px;
      color: blue;
    }
  }
}
</style>