<template>
  <div class="services my-5">
    <div class="container">
      <div class="accordion" id="accordion1">
        <div class="accordion-item" v-for="(service, i) in services" :data-aos="i % 2 ? 'fade-left' : 'fade-right'">
          <h2 class="accordion-header">
            <button
              class="accordion-button collapsed"
              type="button"
              data-bs-toggle="collapse"
              :data-bs-target="'#collapse' + i"
            >
              {{ service.title }}
            </button>
          </h2>
          <div :id="'collapse' + i" :class="'accordion-collapse collapse'" data-bs-parent="#accordion1">
            <div class="accordion-body">{{ service.description }}</div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Services",
  data: () => ({
    services: [
      {
        title: "Токарные",
        description:
          "Токарные работы включают обработку металлических деталей на токарных станках. Эта операция позволяет придать изделию нужную форму и размеры, обеспечивая точность и качество. Токарные работы применяются в различных отраслях для производства валов, втулок, осей и других цилиндрических деталей.",
      },
      {
        title: "Фрезерные",
        description:
          "Фрезерные работы позволяют обрабатывать поверхности и формировать сложные геометрические формы. Это достигается с помощью вращающегося инструмента, который снимает слой материала. Фрезерование используется для создания пазов, канавок и других элементов на деталях.",
      },
      {
        title: "Зубонарезные",
        description:
          "Зубонарезные работы включают обработку деталей с целью создания зубчатых элементов, таких как шестерни и зубчатые колеса. Этот процесс требует высокой точности и используется для передачи движения в механических системах.",
      },
      {
        title: "Полировка",
        description:
          "Полировка позволяет достичь гладкой и блестящей поверхности изделия. Этот процесс удаляет микроскопические неровности и придает детали законченный вид. Полировка часто используется для финальной обработки деталей перед их установкой в готовые изделия.",
      },
      {
        title: "Шлифовка",
        description:
          "Шлифовка применяется для обработки поверхности детали с целью достижения высокой точности и гладкости. Этот процесс удаляет минимальный слой материала, что позволяет устранить мелкие дефекты и придать детали нужные параметры.",
      },
      {
        title: "Закалка металла",
        description:
          "Закалка металла — это термическая обработка, которая увеличивает прочность и износостойкость детали. Процесс заключается в нагреве и быстром охлаждении металла, что изменяет его структуру и повышает эксплуатационные характеристики.",
      },
      {
        title: "Отрезка металла",
        description:
          "Отрезка металла включает разделение материала на заготовки или готовые детали. Этот процесс позволяет быстро и точно подготовить материал для дальнейшей обработки или использования в производстве.",
      },
      {
        title: "Плазменная резка",
        description:
          "Плазменная резка — это метод разделения металла с использованием высокотемпературной плазмы. Этот способ позволяет точно и быстро резать различные виды металлов, обеспечивая чистые и ровные края.",
      },
      {
        title: "Изготовление шнеков",
        description:
          "Изготовление шнеков включает производство деталей, используемых в различных транспортировочных и технологических системах. Шнеки применяются для перемещения сыпучих материалов или жидкостей в промышленности.",
      },
      {
        title: "Обработка заготовок на станках до 6 метров, до 3 тонн",
        description:
          "Обработка и подготовка металлических заготовок больших размеров — до 6 метров в длину и весом до 3 тонн. Это позволяет изготавливать крупные детали для различных промышленных нужд.",
      },
      {
        title: "Проектные работы, разработка чертежей",
        description:
          "Проектные работы и разработка чертежей включают создание технической документации для производства деталей и оборудования. Это важный этап, который обеспечивает точное соответствие изделий требованиям и стандартам.",
      },
      {
        title: "Производство нестандартного оборудования",
        description:
          "Производство нестандартного оборудования включает разработку и изготовление уникальных решений под заказ. Эти изделия создаются с учетом специфики задач клиента и не имеют аналогов на рынке.",
      },
      {
        title: "Установка оборудования, ввод в эксплуатацию",
        description:
          "Установка оборудования и ввод в эксплуатацию включают монтаж и настройку машин и устройств на производственных площадках клиента. Этот процесс гарантирует корректную работу оборудования и его готовность к использованию.",
      },
      {
        title: "Послегарантийное обслуживание",
        description:
          "Послегарантийное обслуживание обеспечивает поддержку оборудования после окончания гарантийного срока. Это включает регулярные проверки, ремонт и обновление оборудования для поддержания его работоспособности.",
      },
    ],
  }),
};
</script>

<style lang="scss">
.services {
  ul {
    margin: 0 auto;
    max-width: 700px;
    font-size: 18px;

    li {
    }
  }
}
</style>
